; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v2 ?v13)
             (pred_4 ?v9 ?v12)
             (pred_5 ?v2 ?v12)
             (pred_11 ?v8 ?v2 )
	     (pred_8 ?v2)
             (pred_1 ?v7)
             (pred_12 ?v9)
             (pred_3 ?v12)
             (pred_2 ?v2)
             (pred_10 ?v9)
             (pred_6 ?v2)
             (pred_7 ))



(:action op_5
:parameters (?v3 ?v1 ?v5 ?v4)
:precondition (and (pred_1 ?v3) (pred_1 ?v1) (pred_12 ?v5) (pred_3 ?v4)
          (pred_9 ?v3 ?v1) (pred_4 ?v5 ?v4)
                   (pred_5 ?v1 ?v4) (pred_8 ?v3) 
                   (pred_2 ?v1) (pred_10 ?v5))
:effect (and  (pred_6 ?v1) (not (pred_2 ?v1))))


(:action op_2
:parameters (?v3 ?v11)
:precondition (and (pred_1 ?v3) (pred_1 ?v11)
               (pred_8 ?v3) (pred_9 ?v3 ?v11) (pred_6 ?v11))
:effect (and (pred_8 ?v11) (not (pred_8 ?v3))))

(:action op_1
:parameters (?v3 ?v5)
:precondition (and (pred_1 ?v3) (pred_12 ?v5) 
                  (pred_8 ?v3) (pred_11 ?v5 ?v3) (pred_7 ))
:effect (and (pred_10 ?v5)
   (not (pred_11 ?v5 ?v3)) (not (pred_7 ))))


(:action op_4
:parameters (?v3 ?v10 ?v6)
:precondition (and (pred_1 ?v3) (pred_12 ?v10) (pred_12 ?v6)
                  (pred_8 ?v3) (pred_10 ?v6) (pred_11 ?v10 ?v3))
:effect (and (pred_10 ?v10) (pred_11 ?v6 ?v3)
        (not (pred_10 ?v6)) (not (pred_11 ?v10 ?v3))))

(:action op_3
:parameters (?v3 ?v5)
:precondition (and (pred_1 ?v3) (pred_12 ?v5) 
                  (pred_8 ?v3) (pred_10 ?v5))
:effect (and (pred_7 ) (pred_11 ?v5 ?v3) (not (pred_10 ?v5)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_08 obj_12 obj_03 obj_07 obj_10 obj_09 obj_15 obj_20 obj_05 obj_11 obj_16 obj_01 obj_04 obj_14 obj_02
    obj_18 obj_13
    obj_19 obj_06
    )

    (:init
       (pred_7)

       (pred_1 obj_17)
       (pred_1 obj_08)
       (pred_1 obj_12)
       (pred_1 obj_03)
       (pred_1 obj_07)
       (pred_1 obj_10)
       (pred_1 obj_09)
       (pred_1 obj_15)
       (pred_1 obj_20)
       (pred_1 obj_05)
       (pred_1 obj_11)
       (pred_1 obj_16)
       (pred_1 obj_01)
       (pred_1 obj_04)
       (pred_1 obj_14)
       (pred_1 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_06)

       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_08)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_17)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_03 obj_15)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_10)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_10 obj_05)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_07)
       (pred_9 obj_09 obj_11)
       (pred_9 obj_09 obj_15)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_15 obj_16)
       (pred_9 obj_15 obj_03)
       (pred_9 obj_15 obj_09)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_10)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_11 obj_14)
       (pred_9 obj_11 obj_16)
       (pred_9 obj_11 obj_09)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_16 obj_15)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_01 obj_04)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_01)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_14 obj_11)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_02 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_02)
       (pred_5  obj_08 obj_18)
       (pred_5  obj_02 obj_13)
       (pred_6 obj_17)
       (pred_6 obj_12)
       (pred_6 obj_03)
       (pred_6 obj_07)
       (pred_6 obj_10)
       (pred_6 obj_09)
       (pred_6 obj_15)
       (pred_6 obj_20)
       (pred_6 obj_05)
       (pred_6 obj_11)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_04)
       (pred_6 obj_14)

       (pred_4  obj_19 obj_18)
       (pred_4  obj_06 obj_13)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_06 obj_20)
       (pred_8 obj_10)
    )

    (:goal (and
       (pred_11 obj_06 obj_15)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_2 obj_10 obj_07)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_07)
   goals met: 0 of 1
2. (op_2 obj_07 obj_20)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_20)
   goals met: 0 of 1
3. (op_1 obj_20 obj_06)
   deleted: (pred_11 obj_06 obj_20) (pred_7)
   added: (pred_10 obj_06)
   goals met: 0 of 1
4. (op_2 obj_20 obj_05)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_05)
   goals met: 0 of 1
5. (op_2 obj_05 obj_11)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_11)
   goals met: 0 of 1
6. (op_2 obj_11 obj_16)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_16)
   goals met: 0 of 1
7. (op_2 obj_16 obj_15)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_15)
   goals met: 0 of 1
8. (op_3 obj_15 obj_06)
   deleted: (pred_10 obj_06)
   added: (pred_7) (pred_11 obj_06 obj_15)
   goals met: 1 of 1
